tutorials4HD/hemodynamic4HD/FSI/meshGenerationFE41/solid/constant/extrudeProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;
sourceCase "../fluid";

sourcePatch	consoleFluid;

extrudeModel        linearNormal;
patchType     	    wall;

nLayers             4;
expansionRatio      1.0;
linearNormalCoeffs
{
    thickness    0.4e-3;
}


flipNormals false;
mergeFaces false;
mergeTol 0;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
